"use strict"
console.log("Using Strict (modern mode)")

// Директива "use strict"; определяет, что код JavaScript должен выполняться в "строгом режиме".

// Директива "use strict"
// Директива "use strict" была новой в ECMAScript версии 5

// Это не утверждение, а буквальное выражение, игнорируемое более ранними версиями JavaScript.

// Назначение "use strict" - указать, что код должен выполняться в "строгом режиме".

// В строгом режиме нельзя, например, использовать необъявленные переменные.
/*
Строгий режим упрощает написание "безопасного" JavaScript.

Строгий режим изменяет ранее принятый "плохой синтаксис" на реальные ошибки.

Например, в обычном JavaScript неправильный ввод имени переменной создает новую глобальную переменную. В строгом режиме это вызовет ошибку, что сделает невозможным случайное создание глобальной переменной.

В обычном JavaScript разработчик не будет получать никаких сообщений об ошибках, присваивая значения свойствам, недоступным для записи.

В строгом режиме любое присвоение недоступному для записи свойству, только для получения, несуществующему свойству, несуществующей переменной или несуществующему объекту вызовет ошибку.*/